import type { Question } from '../types';

export const questions: Question[] = [
  {
    id: 'q1',
    text: 'لنفرض ان شريك حياتك عاد الى البيت بعد يوم طويل , وكان هادئا اكثر من المعتاد . ماذا سيكون اول تصرف منش ؟',
    choices: [
      { label: 'اسأله بهدوء اذا كان بخير , واعطية مساحة لو احتاجها ', value: 'space' },
      { label: ' ربما يشعر بتعب أو ضغط , وافتح الحديث معه عندما اشعر انه مستعد ', value: 'tired' },
      {
        label:
          'أفتح جلسة تحقيق , ماحصل؟ , وليش ماتشتي ت الكلام الان ؟اعترف من هي اللي زعلتك في الدوام؟ 😂',
        value: 'angry',
        isComedy: true,
        comedyAnalysis:
          '⛔️ تم تفعيل وضع المحقق كونان 😂 , للأسف لم يتم العثور على اي متهم .... , اشتي اجابة من ريم , مش من قسم التحريات 🌚',
      },
    ],
  },
  {
    id: 'q2',
    text: 'سمعتي قصة غير ناجحة وسلبية عن زواج شخصين "ايش اول انطباع يخطر في بالش ؟"',
    choices: [
      { label: 'لكل علاقة ظروفها , ولا احب ان اقيس حياتي على حياة غيري ', value: 'message' },
      { label: 'استفيد من القصة , بس ماخليها تحكم مستقبلي ', value: 'space_wait' },
      {
        label: 'افتح دفتر "قصص الرعب الزوجية " واضيفها للفصل السابع 😂🌚',
        value: 'eyes',
        isComedy: true,
        comedyAnalysis:
          'تم اكتشاف ارشيف ضخم من القصص 🫣 , "لكن نتذكر ان كل قصة لها مؤلفيها , وليست بالضروره تكون بداية لقصتنا�وتى , نشتي الاجابة اللي تشبهك اكثر ',
      },
    ],
  },
  {
    id: 'q3',
    text: 'بعد الزواج اكتشفتي ان شريك حياتش يختلف عنك في بعض الطباع  "ماعتفعلي ؟" ',
    choices: [
      { label: 'احاول ان اتفهمه , ونتعلم كيف نتعامل مع اختلافنا ', value: 'sit_together' },
      { label: 'نتكلم بكل صراحة عن كل شي , وندور طريقة عشان نتعامل مع اختلافاتنا', value: 'laugh' },
      {
        label: 'ابحث في الاعدادات عن زر " تحديث الزوج للإصدار الجديد " 😂 ',
        value: 'sleep',
        isComedy: true,
        comedyAnalysis:
          'جاري البحث عن التحديث الجديد .....🕵🏻 , " للأسف الانسان لايعمل بالتحديثات 😂🤍 " , لكن الجميل فيه انه يستطيع ان يتعلم ويتغير اذا وجد من يفهمه 🤍 ',
      },
    ],
  },
];
